---
kind: property
id: P:Autodesk.Revit.DB.EdgeEndPoint.Edge
source: html/c4f5ff6e-da5b-5775-50a7-f918f5224fc7.htm
---
# Autodesk.Revit.DB.EdgeEndPoint.Edge Property

The Edge.

## Syntax (C#)
```csharp
public Edge Edge { get; }
```